Требуется разработать онлайн-калькулятор, решающий задачу, соответствующей номеру варианта. Исходные данные вводятся через HTML-форму, результат выводится на экран. После отправки формы и перезагрузки страницы поля ввода должны быть заполнены прежними значениями.
Правила оформления данных:
●	при выводе дробные значения должны быть округлены до второго знака после запятой, в качестве разделителя дробной и целой части должна использоваться запятая, рекомендуется использовать функцию number_format,
●	если выходные данные представляют собой денежные суммы, они должны выводится в формате “22 500, 45 руб.”, тысячи отделяются пробелом, в качестве разделителя целой и дробной части используется запятая.
К геометрическим задачам рекомендуется добавить рисунок с обозначением входных величин. При вводе некорректных значений (не числовых или отрицательных, где такого не может быть) должно выводиться сообщение об ошибке, а данные выводится повторно.

Номер варианта	Задача	Входные данные	Выходные данные	Примечание
1.	Расчет расстояния между точками по координатам	Координаты двух точках	Расстояние	Использовать теорему Пифагора
2.	Расчет высоты треугольника по трем сторонам	Длины трех сторон треугольника	Длина высоты	Использовать формулу расчеты высоты по трем сторонам
3.	Перевод из декартовых координат в полярные	Координаты точки	Длина вектора, угол между вектором и осью координат	Использовать Теорему Пифагора и функцию арктангенса
4.	Перевод из полярных координат в декартовые	Длина вектора, угол между вектором и осью координат	Координаты точки	Использовать функции синуса и косинуса
5.	Решение квадратного уравнения	Элементы уравнения, a, b, c	Два решения, одно решение, нет решений	Использовать стандартные формулы
6.	Расчет гипотенузы по длине катетов	Длины катетов	Длина гипотенузы	Использовать теорему Пифагора
7.	Расчет биссектрисы по длине сторон треугольника	Длины сторон треугольника	Длина биссектрисы	Использовать формулу биссектрисы произвольного треугольника
8.	Расчет медианы треугольника по трем сторонам	Длины сторон треугольника	Длина медианы	Использовать формулу медианы произвольного треугольника
9.	Расчет площади треугольника по трем сторонам	Длины сторон треугольника	Площадь треугольника	Использовать формулу Герона
10.	Расчет площади правильного многоугольника по длине одной стороны и количеству сторон	Длина одной стороны, количество сторон	Площадь многоугольника	Использовать формулу площади правильного многоугольника
11.	Расчет суммы депозита (вклада)	Первоначальная сумма привлеченных в депозит денежных средств, годовая процентная ставка, количество дней начисления процентов по привлеченному вкладу 	Сумма денежных средств, причитающихся к возврату вкладчику по окончании срока депозита	Использовать формулу простых процентов, за число дней в году можно всегда принимать 365 (пренебречь високосным годом)
12.	Расчет суммы депозита (вклада)	Сумма денежных средств, причитающихся к возврату вкладчику по окончании срока депозита, годовая процентная ставка, количество дней начисления процентов по привлеченному вкладу	Первоначальная сумма привлеченных в депозит денежных средств	
13.	Расчет суммы депозита (вклада)	Сумма денежных средств, причитающихся к возврату вкладчику по окончании срока депозита, первоначальная сумма привлеченных в депозит денежных средств, количество дней начисления процентов по привлеченному вкладу	Годовая процентная ставка	
14.	Расчет суммы налога НДФЛ	Налоговая база, сумма вычета. Ставка выбирается из списка: 13%, 35%	Сумма налога	
15.	Расчет площади стен в прямоугольной комнате	Длина, ширина, высота комнаты в метрах	Площадь стен в квадратных метрах	
16.	Определение площади самой большой стены в прямоугольной комнате	Длина, ширина, высота комнаты в метрах	Площадь самой большой стены	

